In [2]:
import pandas as pd

In [4]:
fastfood = 'data/fasfood_data.csv'
food_at_home = 'data/foodathome.csv'
food_away_from_home = 'data/food_away_from_home.csv'
gas_prices = 'data/gas_prices.csv'
grocery_sale = 'data/grocery_sale_data.csv'
grocery_prices = 'data/groceryprices.csv'
unemployment = 'data/UNRATE.csv'

In [5]:
fastfood_df = pd.read_csv(fastfood)
food_at_home_df = pd.read_csv(food_at_home)
food_away_from_home_df = pd.read_csv(food_away_from_home)
gas_prices_df = pd.read_csv(gas_prices)
grocery_sale_df = pd.read_csv(grocery_sale)
grocery_prices_df = pd.read_csv(grocery_prices)
unemployment_df = pd.read_csv(unemployment)

In [8]:
fastfood_df.head()

  observation_date  RSFSDP
0       1992-01-01   16758
1       1992-02-01   16605
2       1992-03-01   16527
3       1992-04-01   16262
4       1992-05-01   16232

In [9]:
food_at_home_df.head()

  observation_date  CUSR0000SAF11
0       1952-01-01           31.2
1       1952-02-01           30.7
2       1952-03-01           30.7
3       1952-04-01           30.8
4       1952-05-01           30.8

In [10]:
gas_prices_df.head()

  observation_date  CUSR0000SETB01
0       1967-01-01            26.3
1       1967-02-01            26.2
2       1967-03-01            26.1
3       1967-04-01            26.4
4       1967-05-01            26.4

In [11]:
grocery_prices_df.head()

  observation_date  CUSR0000SAF11
0       1952-01-01           31.2
1       1952-02-01           30.7
2       1952-03-01           30.7
3       1952-04-01           30.8
4       1952-05-01           30.8

In [12]:
grocery_sale_df.head()

  observation_date  MRTSSM4451USS
0       1992-01-01          27465
1       1992-02-01          27352
2       1992-03-01          27338
3       1992-04-01          27471
4       1992-05-01          27589

In [13]:
unemployment_df.head()

  observation_date  UNRATE
0       1948-01-01     3.4
1       1948-02-01     3.8
2       1948-03-01     4.0
3       1948-04-01     3.9
4       1948-05-01     3.5